{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from SPARQLWrapper import SPARQLWrapper, JSON, CSV\n",
    "import IPython\n",
    "import subprocess\n",
    "import time\n",
    "import os \n",
    "import glob"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "endpointURL_reactome_v87 = \"http://localhost:3030/reactome_v87/query\"\n",
    "endpointURL_panther_standalone_biopax = \"http://localhost:3030/panther_standalone_biopax/query\"\n",
    "endpointURL_reactome_pc = \"http://localhost:3030/reactome_pc/query\"\n",
    "endpointURL_panther_pc = \"http://localhost:3030/panther_pc/query\"\n",
    "endpointURL_pathbank_pc = \"http://localhost:3030/pathbank_pc/query\"\n",
    "endpointURL_humancyc_pc = \"http://localhost:3030/humancyc_pc/query\"\n",
    "endpointURL_kegg_pc = \"http://localhost:3030/kegg_pc/query\"\n",
    "endpointURL_pid_pc = \"http://localhost:3030/pid_pc/query\"\n",
    "endpointURL_inoh_pc = \"http://localhost:3030/inoh_pc/query\"\n",
    "endpointURL_netpath_pc = \"http://localhost:3030/netpath_pc/query\"\n",
    "rdfFormat = \"turtle\"\n",
    "current_directory = os.getcwd()\n",
    "BioPAX_Ontology_file_path = os.path.join(current_directory, '../..', 'BioPAX_Data/BioPAX_Ontology', 'biopax-level3.owl')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "reactomeVersion = 87\n",
    "prefixes = \"\"\"\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX rdfs:<http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "PREFIX dcterms: <http://purl.org/dc/terms/>\n",
    "\n",
    "PREFIX chebi: <http://purl.obolibrary.org/obo/chebi/>\n",
    "PREFIX chebidb: <http://purl.obolibrary.org/obo/CHEBI_>\n",
    "PREFIX chebirel: <http://purl.obolibrary.org/obo/CHEBI#>\n",
    "PREFIX oboInOwl: <http://www.geneontology.org/formats/oboInOwl#>\n",
    "\n",
    "PREFIX bp3: <http://www.biopax.org/release/biopax-level3.owl#>\n",
    "\n",
    "# Homo_sapiens-20170221.owl\n",
    "#PREFIX reactome: <http://www.reactome.org/biopax/59/48887#> \n",
    "#\n",
    "# Homo_sapiens-20210608.owl\n",
    "#PREFIX reactome: <http://www.reactome.org/biopax/77/48887#>\n",
    "#\n",
    "# Homo_sapiens-20220614.owl\n",
    "#PREFIX reactome: <http://www.reactome.org/biopax/81/48887#>\n",
    "#\n",
    "# Homo_sapiens-20221130.owl\n",
    "#PREFIX reactome: <http://www.reactome.org/biopax/83/48887#>\n",
    "\n",
    "PREFIX reactome: <http://www.reactome.org/biopax/{}/48887#>\n",
    "\"\"\".format(reactomeVersion)\n",
    "\n",
    "biopaxURI = \"http://www.biopax.org/release/biopax-level3.owl#\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "def displaySparqlResults(results):\n",
    "    '''\n",
    "    Displays as HTML the result of a SPARQLWrapper query in a Jupyter notebook.\n",
    "    \n",
    "        Parameters:\n",
    "            results (dictionnary): the result of a call to SPARQLWrapper.query().convert()\n",
    "    '''\n",
    "    variableNames = results['head']['vars']\n",
    "    tableCode = '<table><tr><th>{}</th></tr><tr>{}</tr></table>'.format('</th><th>'.join(variableNames), '</tr><tr>'.join('<td>{}</td>'.format('</td><td>'.join([row[vName]['value'] if vName in row.keys() else \"&nbsp;\" for vName in variableNames]))for row in results[\"results\"][\"bindings\"]))\n",
    "    IPython.display.display(IPython.display.HTML(tableCode))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Mappings to UniProt"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "# First SPARQL query using the string \"UniProt\" to map to UniProt resources\n",
    "# BioPAX standalone export, Panther standalone, Reactome PC, Panther PC\n",
    "query1 = \"\"\"\n",
    "SELECT ?metric ?count\n",
    "# Number of instances of Protein\n",
    "WHERE {\n",
    "OPTIONAL {\n",
    "    {\n",
    "        SELECT ?metric (COUNT(DISTINCT ?protein) AS ?count)\n",
    "        WHERE {\n",
    "            BIND(\"Protein\" AS ?metric)\n",
    "            ?protein rdf:type/(rdfs:subClassOf*) bp3:Protein .\n",
    "        }\n",
    "        GROUP BY ?metric\n",
    "    }\n",
    "    UNION\n",
    "    {\n",
    "        SELECT ?metric (COUNT(DISTINCT ?protein_ref) AS ?count)\n",
    "        WHERE {\n",
    "            BIND(\"ProteinReference\" AS ?metric)\n",
    "            ?protein_ref rdf:type bp3:ProteinReference .\n",
    "        }\n",
    "        GROUP BY ?metric\n",
    "    }\n",
    "    UNION\n",
    "    {\n",
    "        SELECT ?metric (COUNT(DISTINCT ?protein_without_ref) AS ?count)\n",
    "        WHERE {\n",
    "            BIND(\"Protein with no PR\" AS ?metric)\n",
    "            OPTIONAL {\n",
    "            ?protein_without_ref rdf:type/(rdfs:subClassOf*) bp3:Protein .\n",
    "            FILTER NOT EXISTS {\n",
    "                ?protein_without_ref bp3:entityReference ?ref .\n",
    "                ?ref rdf:type bp3:ProteinReference .\n",
    "            }\n",
    "        }\n",
    "        }\n",
    "        GROUP BY ?metric\n",
    "    }\n",
    "    UNION\n",
    "    {\n",
    "        SELECT ?metric (COUNT(DISTINCT ?protein_that_map_to_uniprot) AS ?count)\n",
    "        WHERE {\n",
    "            BIND(\"Uniprot mappings\" AS ?metric)\n",
    "            ?protein_that_map_to_uniprot rdf:type/(rdfs:subClassOf*) bp3:Protein .\n",
    "            ?protein_that_map_to_uniprot bp3:entityReference ?protein_ref .\n",
    "            ?protein_ref rdf:type bp3:ProteinReference .\n",
    "            ?protein_ref bp3:xref ?protein_ref_xref .\n",
    "            ?protein_ref_xref rdf:type bp3:UnificationXref .\n",
    "            ?protein_ref_xref bp3:db \"UniProt\" .\n",
    "            ?protein_ref_xref bp3:id ?up_id .\n",
    "        }\n",
    "        GROUP BY ?metric\n",
    "    }\n",
    "    UNION \n",
    "    {\n",
    "        SELECT ?metric (COUNT(DISTINCT ?protein_no_map_to_uniprot) AS ?count)\n",
    "        WHERE {\n",
    "            BIND(\"Protein with no mapping\" AS ?metric)\n",
    "            ?protein_no_map_to_uniprot rdf:type/(rdfs:subClassOf*) bp3:Protein .\n",
    "            ?protein_no_map_to_uniprot bp3:entityReference ?protein_ref .\n",
    "            FILTER NOT EXISTS {\n",
    "                ?protein_ref bp3:xref ?protein_ref_xref .\n",
    "                ?protein_ref_xref rdf:type bp3:UnificationXref .\n",
    "                ?protein_ref_xref bp3:db \"UniProt\" .\n",
    "                ?protein_ref_xref bp3:id ?id .\n",
    "            }\n",
    "        }\n",
    "        GROUP BY ?metric\n",
    "    }\n",
    "    UNION \n",
    "    {\n",
    "        SELECT ?metric (COUNT(DISTINCT ?up_id) AS ?count)\n",
    "        WHERE {\n",
    "            BIND(\"Unique Uniprot\" AS ?metric)\n",
    "            ?unif_xref rdf:type bp3:UnificationXref .\n",
    "            ?unif_xref bp3:db \"UniProt\" .\n",
    "            ?unif_xref bp3:id ?up_id .\n",
    "        }\n",
    "        GROUP BY ?metric\n",
    "    }\n",
    "   }\n",
    "}\n",
    "ORDER BY ?metric\n",
    "\"\"\"\n",
    "\n",
    "# Query for Panther Standalone and Panther PC\n",
    "query2 = \"\"\"\n",
    "SELECT ?metric ?count\n",
    "# Number of instances of Protein\n",
    "WHERE {\n",
    "OPTIONAL {\n",
    "    {\n",
    "        SELECT ?metric (COUNT(DISTINCT ?protein) AS ?count)\n",
    "        WHERE {\n",
    "            BIND(\"Protein\" AS ?metric)\n",
    "            ?protein rdf:type/(rdfs:subClassOf*) bp3:Protein .\n",
    "        }\n",
    "        GROUP BY ?metric\n",
    "    }\n",
    "    UNION\n",
    "    {\n",
    "        SELECT ?metric (COUNT(DISTINCT ?protein_ref) AS ?count)\n",
    "        WHERE {\n",
    "            BIND(\"ProteinReference\" AS ?metric)\n",
    "            ?protein_ref rdf:type/(rdfs:subClassOf*) bp3:ProteinReference .\n",
    "        }\n",
    "        GROUP BY ?metric\n",
    "    }\n",
    "    UNION\n",
    "    {\n",
    "        SELECT ?metric (COUNT(DISTINCT ?protein_without_ref) AS ?count)\n",
    "        WHERE {\n",
    "            BIND(\"Protein with no PR\" AS ?metric)\n",
    "            OPTIONAL {\n",
    "            ?protein_without_ref rdf:type/(rdfs:subClassOf*) bp3:Protein .\n",
    "            FILTER NOT EXISTS {\n",
    "                ?protein_without_ref bp3:entityReference ?ref .\n",
    "                ?ref rdf:type/(rdfs:subClassOf*) bp3:ProteinReference .\n",
    "            }\n",
    "        }\n",
    "        }\n",
    "        GROUP BY ?metric\n",
    "    }\n",
    "    UNION\n",
    "    {\n",
    "        SELECT ?metric (COUNT(DISTINCT ?protein_that_map_to_uniprot) AS ?count)\n",
    "        WHERE {\n",
    "            BIND(\"Uniprot mappings\" AS ?metric)\n",
    "            ?protein_that_map_to_uniprot rdf:type/(rdfs:subClassOf*) bp3:Protein .\n",
    "            ?protein_that_map_to_uniprot bp3:entityReference ?protein_ref .\n",
    "            ?protein_ref rdf:type/(rdfs:subClassOf*) bp3:ProteinReference .\n",
    "            ?protein_ref bp3:memberEntityReference ?member_entity_ref .\n",
    "            ?member_entity_ref bp3:xref ?protein_ref_xref .\n",
    "            ?protein_ref_xref rdf:type/(rdfs:subClassOf*) bp3:UnificationXref .\n",
    "            ?protein_ref_xref bp3:db \"uniprot\" .\n",
    "            ?protein_ref_xref bp3:id ?up_id .\n",
    "        }\n",
    "        GROUP BY ?metric\n",
    "    }\n",
    "    UNION \n",
    "    {\n",
    "        SELECT ?metric (COUNT(DISTINCT ?protein_no_map_to_uniprot) AS ?count)\n",
    "        WHERE {\n",
    "            BIND(\"Protein with no mapping\" AS ?metric)\n",
    "            ?protein_no_map_to_uniprot rdf:type/(rdfs:subClassOf*) bp3:Protein .\n",
    "            ?protein_no_map_to_uniprot bp3:entityReference ?protein_ref .\n",
    "            FILTER NOT EXISTS {\n",
    "                ?protein_ref bp3:memberEntityReference ?member_entity_ref .\n",
    "                ?member_entity_ref bp3:xref ?xref .\n",
    "                ?xref rdf:type/(rdfs:subClassOf*) bp3:UnificationXref .\n",
    "                ?xref bp3:db \"uniprot\" .\n",
    "                ?xref bp3:id ?up_id .\n",
    "            }\n",
    "        }\n",
    "        GROUP BY ?metric\n",
    "    }\n",
    "    UNION \n",
    "    {\n",
    "        SELECT ?metric (COUNT(DISTINCT ?up_id) AS ?count)\n",
    "        WHERE {\n",
    "            BIND(\"Unique Uniprot\" AS ?metric)\n",
    "            ?unif_xref rdf:type/(rdfs:subClassOf*) bp3:UnificationXref .\n",
    "            ?unif_xref bp3:db \"uniprot\" .\n",
    "            ?unif_xref bp3:id ?up_id .\n",
    "        }\n",
    "        GROUP BY ?metric\n",
    "    }\n",
    "   }\n",
    "}\n",
    "ORDER BY ?metric\n",
    "\"\"\"\n",
    "\n",
    "# HumanCyc PC, KEGG PC, PID PC\n",
    "query3 = \"\"\"  \n",
    "SELECT ?metric ?count\n",
    "# Number of instances of Protein\n",
    "WHERE {\n",
    "OPTIONAL {\n",
    "    {\n",
    "        SELECT ?metric (COUNT(DISTINCT ?protein) AS ?count)\n",
    "        WHERE {\n",
    "            BIND(\"Protein\" AS ?metric)\n",
    "            ?protein rdf:type/(rdfs:subClassOf*) bp3:Protein .\n",
    "        }\n",
    "        GROUP BY ?metric\n",
    "    }\n",
    "    UNION\n",
    "    {\n",
    "        SELECT ?metric (COUNT(DISTINCT ?protein_ref) AS ?count)\n",
    "        WHERE {\n",
    "            BIND(\"ProteinReference\" AS ?metric)\n",
    "            ?protein_ref rdf:type bp3:ProteinReference .\n",
    "        }\n",
    "        GROUP BY ?metric\n",
    "    }\n",
    "    UNION\n",
    "    {\n",
    "        SELECT ?metric (COUNT(DISTINCT ?protein_without_ref) AS ?count)\n",
    "        WHERE {\n",
    "            BIND(\"Protein with no PR\" AS ?metric)\n",
    "            OPTIONAL {\n",
    "            ?protein_without_ref rdf:type/(rdfs:subClassOf*) bp3:Protein .\n",
    "            FILTER NOT EXISTS {\n",
    "                ?protein_without_ref bp3:entityReference ?ref .\n",
    "                ?ref rdf:type bp3:ProteinReference .\n",
    "            }\n",
    "        }\n",
    "        }\n",
    "        GROUP BY ?metric\n",
    "    }\n",
    "    UNION\n",
    "    {\n",
    "        SELECT ?metric (COUNT(DISTINCT ?protein_that_map_to_uniprot) AS ?count)\n",
    "        WHERE {\n",
    "            BIND(\"Uniprot mappings\" AS ?metric)\n",
    "            ?protein_that_map_to_uniprot rdf:type bp3:Protein .\n",
    "            ?protein_that_map_to_uniprot bp3:entityReference ?protein_ref .\n",
    "            ?protein_ref rdf:type bp3:ProteinReference .\n",
    "            ?protein_ref bp3:xref ?protein_ref_xref .\n",
    "            ?protein_ref_xref rdf:type bp3:UnificationXref .\n",
    "            ?protein_ref_xref bp3:db \"UniProt\" .\n",
    "            ?protein_ref_xref bp3:id ?up_id .\n",
    "        }\n",
    "        GROUP BY ?metric\n",
    "    }\n",
    "    UNION \n",
    "    {\n",
    "        SELECT ?metric (COUNT(DISTINCT ?protein_no_map_to_uniprot) AS ?count)\n",
    "        WHERE {\n",
    "            BIND(\"Protein with no mapping\" AS ?metric)\n",
    "            ?protein_no_map_to_uniprot rdf:type/(rdfs:subClassOf*) bp3:Protein .\n",
    "            ?protein_no_map_to_uniprot bp3:entityReference ?protein_ref .\n",
    "            FILTER NOT EXISTS {\n",
    "                ?protein_ref bp3:xref ?xref .\n",
    "                ?xref rdf:type bp3:UnificationXref .\n",
    "                ?xref bp3:db \"UniProt\" .\n",
    "                ?xref bp3:id ?id .\n",
    "            }\n",
    "        }\n",
    "        GROUP BY ?metric\n",
    "    }\n",
    "    UNION \n",
    "    {\n",
    "        SELECT ?metric (COUNT(DISTINCT ?up_id) AS ?count)\n",
    "        WHERE {\n",
    "            BIND(\"Unique Uniprot\" AS ?metric)\n",
    "            ?unif_xref rdf:type bp3:UnificationXref .\n",
    "            ?unif_xref bp3:db \"UniProt\" .\n",
    "            ?unif_xref bp3:id ?up_id .\n",
    "        }\n",
    "        GROUP BY ?metric\n",
    "    }\n",
    "   }\n",
    "}\n",
    "ORDER BY ?metric\n",
    "\"\"\"\n",
    "\n",
    "\n",
    "# INOH PC\n",
    "query4 = \"\"\"\n",
    "SELECT ?metric ?count\n",
    "# Number of instances of Protein\n",
    "WHERE {\n",
    "OPTIONAL {\n",
    "    {\n",
    "        SELECT ?metric (COUNT(DISTINCT ?protein) AS ?count)\n",
    "        WHERE {\n",
    "            BIND(\"Protein\" AS ?metric)\n",
    "            ?protein rdf:type/(rdfs:subClassOf*) bp3:Protein .\n",
    "        }\n",
    "        GROUP BY ?metric\n",
    "    }\n",
    "    UNION\n",
    "    {\n",
    "        SELECT ?metric (COUNT(DISTINCT ?protein_ref) AS ?count)\n",
    "        WHERE {\n",
    "            BIND(\"ProteinReference\" AS ?metric)\n",
    "            ?protein_ref rdf:type bp3:ProteinReference .\n",
    "        }\n",
    "        GROUP BY ?metric\n",
    "    }\n",
    "    UNION\n",
    "    {\n",
    "        SELECT ?metric (COUNT(DISTINCT ?protein_without_ref) AS ?count)\n",
    "        WHERE {\n",
    "            BIND(\"Protein with no PR\" AS ?metric)\n",
    "            OPTIONAL {\n",
    "            ?protein_without_ref rdf:type/(rdfs:subClassOf*) bp3:Protein .\n",
    "            FILTER NOT EXISTS {\n",
    "                ?protein_without_ref bp3:entityReference ?ref .\n",
    "                ?ref rdf:type bp3:ProteinReference .\n",
    "            }\n",
    "        }\n",
    "        }\n",
    "        GROUP BY ?metric\n",
    "    }\n",
    "    UNION\n",
    "    {\n",
    "        SELECT ?metric (COUNT(DISTINCT ?protein_that_map_to_uniprot) AS ?count)\n",
    "        WHERE {\n",
    "            BIND(\"Uniprot mappings\" AS ?metric)\n",
    "            ?protein_that_map_to_uniprot rdf:type bp3:Protein .\n",
    "            ?protein_that_map_to_uniprot bp3:entityReference ?protein_ref .\n",
    "            ?protein_ref rdf:type bp3:ProteinReference .\n",
    "            ?protein_that_map_to_uniprot bp3:xref ?protein_xref .\n",
    "            ?protein_xref rdf:type bp3:UnificationXref .\n",
    "            ?protein_xref bp3:db \"UniProt\" .\n",
    "            ?protein_xref bp3:id ?up_id .\n",
    "        }\n",
    "        GROUP BY ?metric\n",
    "    }\n",
    "    UNION \n",
    "    {\n",
    "        SELECT ?metric (COUNT(DISTINCT ?protein_no_map_to_uniprot) AS ?count)\n",
    "        WHERE {\n",
    "            BIND(\"Protein with no mapping\" AS ?metric)\n",
    "            ?protein_no_map_to_uniprot rdf:type/(rdfs:subClassOf*) bp3:Protein .\n",
    "            ?protein_no_map_to_uniprot bp3:entityReference ?protein_ref .\n",
    "            ?protein_ref rdf:type bp3:entityReference .\n",
    "            FILTER NOT EXISTS {\n",
    "                ?protein_no_map_to_uniprot bp3:xref ?protein_xref .\n",
    "                ?protein_xref rdf:type bp3:UnificationXref .\n",
    "                ?protein_xref bp3:db \"UniProt\" .\n",
    "                ?protein_xref bp3:id ?id .\n",
    "            }\n",
    "        }\n",
    "        GROUP BY ?metric\n",
    "    }\n",
    "    UNION \n",
    "    {\n",
    "        SELECT ?metric (COUNT(DISTINCT ?up_id) AS ?count)\n",
    "        WHERE {\n",
    "            BIND(\"Unique Uniprot\" AS ?metric)\n",
    "            ?unif_xref rdf:type bp3:UnificationXref .\n",
    "            ?unif_xref bp3:db \"UniProt\" .\n",
    "            ?unif_xref bp3:id ?up_id .\n",
    "        }\n",
    "        GROUP BY ?metric\n",
    "    }\n",
    "   }\n",
    "}\n",
    "ORDER BY ?metric\n",
    "\"\"\"\n",
    "\n",
    "# NetPath PC\n",
    "query5 = \"\"\" \n",
    "SELECT ?metric ?count\n",
    "# Number of instances of Protein\n",
    "WHERE {\n",
    "OPTIONAL {\n",
    "    {\n",
    "        SELECT ?metric (COUNT(DISTINCT ?protein) AS ?count)\n",
    "        WHERE {\n",
    "            BIND(\"Protein\" AS ?metric)\n",
    "            ?protein rdf:type/(rdfs:subClassOf*) bp3:Protein .\n",
    "        }\n",
    "        GROUP BY ?metric\n",
    "    }\n",
    "    UNION\n",
    "    {\n",
    "        SELECT ?metric (COUNT(DISTINCT ?protein_ref) AS ?count)\n",
    "        WHERE {\n",
    "            BIND(\"ProteinReference\" AS ?metric)\n",
    "            ?protein_ref rdf:type bp3:ProteinReference .\n",
    "        }\n",
    "        GROUP BY ?metric\n",
    "    }\n",
    "    UNION\n",
    "    {\n",
    "        SELECT ?metric (COUNT(DISTINCT ?protein_without_ref) AS ?count)\n",
    "        WHERE {\n",
    "            BIND(\"Protein with no PR\" AS ?metric)\n",
    "            OPTIONAL {\n",
    "            ?protein_without_ref rdf:type/(rdfs:subClassOf*) bp3:Protein .\n",
    "            FILTER NOT EXISTS {\n",
    "                ?protein_without_ref bp3:entityReference ?ref .\n",
    "                ?ref rdf:type bp3:ProteinReference .\n",
    "            }\n",
    "        }\n",
    "        }\n",
    "        GROUP BY ?metric\n",
    "    }\n",
    "    UNION\n",
    "    {\n",
    "        SELECT ?metric (COUNT(DISTINCT ?protein_that_map_to_uniprot) AS ?count)\n",
    "        WHERE {\n",
    "            BIND(\"Uniprot mappings\" AS ?metric)\n",
    "            ?protein_that_map_to_uniprot rdf:type/(rdfs:subClassOf*) bp3:Protein .\n",
    "            ?protein_that_map_to_uniprot bp3:entityReference ?protein_ref .\n",
    "            ?protein_ref rdf:type bp3:ProteinReference .\n",
    "            ?protein_ref bp3:xref ?protein_ref_xref .\n",
    "            ?protein_ref_xref rdf:type bp3:UnificationXref .\n",
    "            ?protein_ref_xref bp3:db \"UniProt\"^^<xsd:string> .\n",
    "            ?protein_ref_xref bp3:id ?up_id .\n",
    "        }\n",
    "        GROUP BY ?metric\n",
    "    }\n",
    "    UNION \n",
    "    {\n",
    "        SELECT ?metric (COUNT(DISTINCT ?protein_no_map_to_uniprot) AS ?count)\n",
    "        WHERE {\n",
    "            BIND(\"Protein with no mapping\" AS ?metric)\n",
    "            ?protein_no_map_to_uniprot rdf:type/(rdfs:subClassOf*) bp3:Protein .\n",
    "            ?protein_no_map_to_uniprot bp3:entityReference ?protein_ref .\n",
    "            FILTER NOT EXISTS {\n",
    "                ?protein_ref bp3:xref ?protein_ref_xref .\n",
    "                ?protein_ref_xref rdf:type bp3:UnificationXref .\n",
    "                ?protein_ref_xref bp3:db \"UniProt\"^^<xsd:string> .\n",
    "                ?protein_ref_xref bp3:id ?id .\n",
    "            }\n",
    "        }\n",
    "        GROUP BY ?metric\n",
    "    }\n",
    "    UNION \n",
    "    {\n",
    "        SELECT ?metric (COUNT(DISTINCT ?up_id) AS ?count)\n",
    "        WHERE {\n",
    "            BIND(\"Unique Uniprot\" AS ?metric)\n",
    "            ?unif_xref rdf:type bp3:UnificationXref .\n",
    "            ?unif_xref bp3:db \"UniProt\"^^<xsd:string> .\n",
    "            ?unif_xref bp3:id ?up_id .\n",
    "        }\n",
    "        GROUP BY ?metric\n",
    "    }\n",
    "   }\n",
    "}\n",
    "ORDER BY ?metric\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "TODO: change the path to fuseki server and BioPAX files + BioPAX ontology in the command line to launch the SPARQL endpoint"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Query on Reactome BioPAX standalone export version 87"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "ReactomeBioPAX_file_path = os.path.join(current_directory, '../..', 'BioPAX_Data/ReactomeBioPAX/', 'Homo_sapiens.owl')\n",
    "command = [\n",
    "    '/home/cbeust/Softwares/JenaFuseki/apache-jena-fuseki-4.9.0/fuseki-server',\n",
    "    '--file', ReactomeBioPAX_file_path,\n",
    "    '--file', BioPAX_Ontology_file_path,\n",
    "    '/reactome_v87']\n",
    "\n",
    "process = subprocess.Popen(command)\n",
    "time.sleep(60)\n",
    "\n",
    "# execute SPARQL query\n",
    "sparql = SPARQLWrapper(endpointURL_reactome_v87)\n",
    "sparql.setQuery(prefixes+query1)\n",
    "\n",
    "# display results\n",
    "sparql.setReturnFormat(JSON)\n",
    "results = sparql.query().convert()\n",
    "displaySparqlResults(results)\n",
    "\n",
    "# export to CSV\n",
    "sparql.setReturnFormat(CSV)\n",
    "results = sparql.query().convert()\n",
    "with open(f\"../Results/reactome_v87_mappings_uniprot.csv\", \"wb\") as f:\n",
    "    f.write(results)\n",
    "\n",
    "# end process\n",
    "process.kill()\n",
    "time.sleep(60)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Query on Panther standalone BioPAX export"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "PathwayCommons_Panther_file_path = os.path.join(current_directory, '../..', 'BioPAX_Data/PantherBioPAX/BioPAX/')\n",
    "Panther_owl_files = glob.glob(os.path.join(PathwayCommons_Panther_file_path, '*.owl'))\n",
    "\n",
    "# remove incorrect owl files and add the corrected ones\n",
    "to_remove = os.path.join(PathwayCommons_Panther_file_path, 'Gonadotropin_releasing_hormone_receptor_pathway.owl')\n",
    "Panther_owl_files.remove(to_remove)\n",
    "to_add = os.path.join(PathwayCommons_Panther_file_path, 'Gonadotropin_releasing_hormone_receptor_pathway_corrected.owl')\n",
    "Panther_owl_files.append(to_add)\n",
    "print(len(Panther_owl_files))\n",
    "\n",
    "command = ['/home/cbeust/Softwares/JenaFuseki/apache-jena-fuseki-4.9.0/fuseki-server',]\n",
    "\n",
    "for owl_file in Panther_owl_files:\n",
    "    command += ['--file'] \n",
    "    command += [f'{owl_file}']\n",
    "command += ['--file']\n",
    "command += [f'{BioPAX_Ontology_file_path}']\n",
    "command += ['/panther_standalone_biopax']\n",
    "\n",
    "print(command)\n",
    "\n",
    "process = subprocess.Popen(command)\n",
    "time.sleep(60)\n",
    "# execute SPARQL query\n",
    "sparql = SPARQLWrapper(endpointURL_panther_standalone_biopax)\n",
    "sparql.setQuery(prefixes+query2) \n",
    "\n",
    "# display results\n",
    "sparql.setReturnFormat(JSON)\n",
    "results = sparql.query().convert()\n",
    "displaySparqlResults(results)\n",
    "\n",
    "# export results to CSV\n",
    "sparql.setReturnFormat(CSV)\n",
    "results = sparql.query().convert()\n",
    "with open(f\"../Results/panther_standalone_mappings_uniprot.csv\", \"wb\") as f:\n",
    "    f.write(results)\n",
    "\n",
    "# end process\n",
    "process.kill()\n",
    "time.sleep(60)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Query on BioPAX export of Reactome from PathwayCommons"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "PathwayCommons_Reactome_file_path = os.path.join(current_directory, '../..', 'BioPAX_Data/PathwayCommons/reactome_pc/', 'Homo_sapiens.owl')\n",
    "command = [\n",
    "    '/home/cbeust/Softwares/JenaFuseki/apache-jena-fuseki-4.9.0/fuseki-server',\n",
    "    '--file', PathwayCommons_Reactome_file_path,\n",
    "    '--file', BioPAX_Ontology_file_path,\n",
    "    '/reactome_pc']\n",
    "\n",
    "process = subprocess.Popen(command)\n",
    "time.sleep(60)\n",
    "\n",
    "# execute SPARQL query\n",
    "sparql = SPARQLWrapper(endpointURL_reactome_pc)\n",
    "sparql.setQuery(prefixes+query1)\n",
    "\n",
    "# display results\n",
    "sparql.setReturnFormat(JSON)\n",
    "results = sparql.query().convert()\n",
    "displaySparqlResults(results)\n",
    "\n",
    "# export to CSV\n",
    "sparql.setReturnFormat(CSV)\n",
    "results = sparql.query().convert()\n",
    "with open(f\"../Results/reactome_pc_mappings_uniprot.csv\", \"wb\") as f:\n",
    "    f.write(results)\n",
    "\n",
    "# end process    \n",
    "process.kill()\n",
    "time.sleep(60)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Query on BioPAX export of Panther from PathwayCommons"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "PathwayCommons_Panther_file_path = os.path.join(current_directory, '../..', 'BioPAX_Data/PathwayCommons/panther_pc/')\n",
    "Panther_owl_files = glob.glob(os.path.join(PathwayCommons_Panther_file_path, '*.owl'))\n",
    "\n",
    "# remove incorrect owl files and add the corrected ones\n",
    "to_remove = os.path.join(PathwayCommons_Panther_file_path, 'Gonadotropin_releasing_hormone_receptor_pathway.owl')\n",
    "Panther_owl_files.remove(to_remove)\n",
    "to_add = os.path.join(PathwayCommons_Panther_file_path, 'Gonadotropin_releasing_hormone_receptor_pathway_corrected.owl')\n",
    "Panther_owl_files.append(to_add)\n",
    "print(len(Panther_owl_files))\n",
    "\n",
    "\n",
    "command = ['/home/cbeust/Softwares/JenaFuseki/apache-jena-fuseki-4.9.0/fuseki-server',]\n",
    "\n",
    "for owl_file in Panther_owl_files:\n",
    "    command += ['--file'] \n",
    "    command += [f'{owl_file}']\n",
    "command += ['--file']\n",
    "command += [f'{BioPAX_Ontology_file_path}']\n",
    "command += ['/panther_pc']\n",
    "\n",
    "process = subprocess.Popen(command)\n",
    "time.sleep(60)\n",
    "\n",
    "# execute SPARQL query\n",
    "sparql = SPARQLWrapper(endpointURL_panther_pc)\n",
    "sparql.setQuery(prefixes+query2)\n",
    "\n",
    "# display results\n",
    "sparql.setReturnFormat(JSON)\n",
    "results = sparql.query().convert()\n",
    "displaySparqlResults(results)\n",
    "\n",
    "# export to CSV\n",
    "sparql.setReturnFormat(CSV)\n",
    "results = sparql.query().convert()\n",
    "with open(\"../Results/panther_pc_mappings_uniprot.csv\", \"wb\") as f:\n",
    "    f.write(results)\n",
    "\n",
    "# end process\n",
    "process.kill()\n",
    "time.sleep(60)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Query on BioPAX export of PathBank from PathwayCommons"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Update the PathwayCommons Pathbank OWL files\n",
    "PathwayCommons_Pathbank_file_path = os.path.join(current_directory, '../..', 'BioPAX_Data/PathwayCommons/pathbank_pc/')\n",
    "Pathbank_owl_files = glob.glob(os.path.join(PathwayCommons_Pathbank_file_path, '*.owl'))\n",
    "\n",
    "# Remove the incorrect owl file and add the corrected one\n",
    "to_remove1 = os.path.join(PathwayCommons_Pathbank_file_path, 'PW123534.owl')\n",
    "to_remove2 = os.path.join(PathwayCommons_Pathbank_file_path, 'PW002037.owl')\n",
    "Pathbank_owl_files.remove(to_remove1)\n",
    "Pathbank_owl_files.remove(to_remove2)\n",
    "to_add1 = os.path.join(PathwayCommons_Pathbank_file_path, 'PW123534_corrected.owl')\n",
    "to_add2 = os.path.join(PathwayCommons_Pathbank_file_path, 'PW002037_corrected.owl')\n",
    "Pathbank_owl_files.append(to_add1)\n",
    "Pathbank_owl_files.append(to_add2)\n",
    "\n",
    "command = ['/home/cbeust/Softwares/JenaFuseki/apache-jena-fuseki-4.9.0/fuseki-server',]\n",
    "\n",
    "for owl_file in Pathbank_owl_files:\n",
    "    command += ['--file'] \n",
    "    command += [f'{owl_file}']\n",
    "command += ['--file']\n",
    "command += [f'{BioPAX_Ontology_file_path}']\n",
    "command += ['/pathbank_pc']\n",
    "\n",
    "\n",
    "process = subprocess.Popen(command)\n",
    "time.sleep(60)\n",
    "\n",
    "# execute SPARQL query\n",
    "sparql = SPARQLWrapper(endpointURL_pathbank_pc)\n",
    "sparql.setQuery(prefixes+query1)\n",
    "\n",
    "# display results\n",
    "sparql.setReturnFormat(JSON)\n",
    "results = sparql.query().convert()\n",
    "displaySparqlResults(results)\n",
    "\n",
    "# export to CSV\n",
    "sparql.setReturnFormat(CSV)\n",
    "results = sparql.query().convert()\n",
    "with open(\"../Results/pathbank_pc_mappings_uniprot.csv\", \"wb\") as f:\n",
    "    f.write(results)\n",
    "\n",
    "# end process\n",
    "process.kill()\n",
    "time.sleep(60)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Query on BioPAX export of HumanCyc from PathwayCommons"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "PathwayCommons_Humancyc_file_path = os.path.join(current_directory, '../..', 'BioPAX_Data/PathwayCommons/humancyc_pc/', 'biopax-level3.owl')\n",
    "command = [\n",
    "    '/home/cbeust/Softwares/JenaFuseki/apache-jena-fuseki-4.9.0/fuseki-server',\n",
    "    '--file', PathwayCommons_Humancyc_file_path,\n",
    "    '--file', BioPAX_Ontology_file_path,\n",
    "    '/humancyc_pc']\n",
    "\n",
    "process = subprocess.Popen(command)\n",
    "time.sleep(60)\n",
    "\n",
    "# execute SPARQL query\n",
    "sparql = SPARQLWrapper(endpointURL_humancyc_pc)\n",
    "sparql.setQuery(prefixes+query3)\n",
    "\n",
    "# display results\n",
    "sparql.setReturnFormat(JSON)\n",
    "results = sparql.query().convert()\n",
    "displaySparqlResults(results)\n",
    "\n",
    "# export to CSV\n",
    "sparql.setReturnFormat(CSV)\n",
    "results = sparql.query().convert()\n",
    "with open(\"../Results/humancyc_pc_mappings_uniprot.csv\", \"wb\") as f:\n",
    "    f.write(results)\n",
    "\n",
    "# end process\n",
    "process.kill()\n",
    "time.sleep(60)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Query on BioPAX export of KEGG from PathwayCommons"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "PathwayCommons_Kegg_file_path = os.path.join(current_directory, '../..', 'BioPAX_Data/PathwayCommons/kegg_pc/')\n",
    "Kegg_owl_files = glob.glob(os.path.join(PathwayCommons_Kegg_file_path, '*.owl'))\n",
    "command = ['/home/cbeust/Softwares/JenaFuseki/apache-jena-fuseki-4.9.0/fuseki-server',]\n",
    "\n",
    "for owl_file in Kegg_owl_files:\n",
    "    command += ['--file'] \n",
    "    command += [f'{owl_file}']\n",
    "command += ['--file']\n",
    "command += [f'{BioPAX_Ontology_file_path}']\n",
    "command += ['/kegg_pc']\n",
    "\n",
    "\n",
    "process = subprocess.Popen(command)\n",
    "time.sleep(60)query5\n",
    "\n",
    "# execute SPARQL query\n",
    "sparql = SPARQLWrapper(endpointURL_kegg_pc)\n",
    "sparql.setQuery(prefixes+query3)\n",
    "\n",
    "# display results\n",
    "sparql.setReturnFormat(JSON)\n",
    "results = sparql.query().convert()\n",
    "displaySparqlResults(results)\n",
    "\n",
    "# export to CSV\n",
    "sparql.setReturnFormat(CSV)\n",
    "results = sparql.query().convert()\n",
    "with open(\"../Results/kegg_pc_mappings_uniprot.csv\", \"wb\") as f:\n",
    "    f.write(results)\n",
    "\n",
    "# end process\n",
    "process.kill()\n",
    "time.sleep(60)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Query on BioPAX export of PID from PathwayCommons"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "PathwayCommons_Pid_file_path = os.path.join(current_directory, '../..', 'BioPAX_Data/PathwayCommons/pid_pc/NCI-Nature-Curated-final.bp3.owl')\n",
    "command = [\n",
    "    '/home/cbeust/Softwares/JenaFuseki/apache-jena-fuseki-4.9.0/fuseki-server',\n",
    "    '--file', PathwayCommons_Pid_file_path,\n",
    "    '--file', BioPAX_Ontology_file_path,\n",
    "    '/pid_pc']\n",
    "process = subprocess.Popen(command)\n",
    "time.sleep(60)\n",
    "\n",
    "# execute SPARQL query\n",
    "sparql = SPARQLWrapper(endpointURL_pid_pc)\n",
    "sparql.setQuery(prefixes+query3)\n",
    "\n",
    "# display results\n",
    "sparql.setReturnFormat(JSON)\n",
    "results = sparql.query().convert()\n",
    "displaySparqlResults(results)\n",
    "\n",
    "# export to CSV\n",
    "sparql.setReturnFormat(CSV)\n",
    "results = sparql.query().convert()\n",
    "with open(\"../Results/pid_pc_mappings_uniprot.csv\", \"wb\") as f:\n",
    "    f.write(results)\n",
    "\n",
    "# end process\n",
    "process.kill()\n",
    "time.sleep(60)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Query on BioPAX export of INOH from PathwayCommons"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "17:23:44 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/metabolic/Citrate_cycle.owl\n",
      "17:23:45 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/metabolic/Inositol_phosphate_metabolism.owl\n",
      "17:23:45 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/metabolic/Glycine_Serine_metabolism.owl\n",
      "17:23:45 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/metabolic/Tryptophan_degradation.owl\n",
      "17:23:45 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/metabolic/Pentose_phosphate_cycle.owl\n",
      "17:23:46 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/metabolic/Pyrimidine_nucleotides_nucleosides_metabolism.owl\n",
      "17:23:46 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/metabolic/Butanoate_metabolism.owl\n",
      "17:23:46 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/metabolic/Vitamin_B6_metabolism.owl\n",
      "17:23:46 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/metabolic/Valine_Leucine_Isoleucine_degradation.owl\n",
      "17:23:46 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/metabolic/Purine_nucleotides_nucleosides_metabolism.owl\n",
      "17:23:46 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/metabolic/Aminosugars_metabolism.owl\n",
      "17:23:46 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/metabolic/Alanine_Aspartate_Asparagine_metabolism.owl\n",
      "17:23:46 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/metabolic/Prostaglandin_Leukotriene_metabolism.owl\n",
      "17:23:46 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/metabolic/Fructose_Mannose_metabolism.owl\n",
      "17:23:46 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/metabolic/Methionine_Cysteine_metabolism.owl\n",
      "17:23:46 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/metabolic/Tyrosine_metabolism.owl\n",
      "17:23:46 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/metabolic/Phenylalanine_degradation.owl\n",
      "17:23:46 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/metabolic/Folate_metabolism.owl\n",
      "17:23:46 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/metabolic/Glycolysis_Gluconeogenesis.owl\n",
      "17:23:46 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/metabolic/Galactose_metabolism.owl\n",
      "17:23:46 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/metabolic/Glutamate_Glutamine_metabolism.owl\n",
      "17:23:46 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/metabolic/Steroids_metabolism.owl\n",
      "17:23:46 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/metabolic/Porphyrin_metabolism.owl\n",
      "17:23:46 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/metabolic/Arginine_Proline_metabolism.owl\n",
      "17:23:47 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/metabolic/Lysine_degradation.owl\n",
      "17:23:47 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/metabolic/Nicotinate_Nicotinamide_metabolism.owl\n",
      "17:23:47 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/metabolic/Histidine_degradation.owl\n",
      "17:23:47 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/metabolic/Pyruvate_metabolism.owl\n",
      "17:23:47 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/metabolic/Propanoate_metabolism.owl\n",
      "17:23:47 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/JAK_STAT_MolecularVariation_1.owl\n",
      "17:23:47 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/TLR_NFkB.owl\n",
      "17:23:47 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/insulin_Cae.owl\n",
      "17:23:47 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/IL-1_NFkB.owl\n",
      "17:23:47 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/CD4_T_cell_receptor_signaling-ERK_cascade-.owl\n",
      "17:23:47 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/IL-10_signaling.owl\n",
      "17:23:48 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/FGF_Cae.owl\n",
      "17:23:48 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/JAK_STAT_MolecularVariation_2.owl\n",
      "17:23:48 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/TLR_p38.owl\n",
      "17:23:48 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/JAK_STAT_pathway_and_regulation.owl\n",
      "17:23:48 WARN  riot            :: [line: 23022, col: 73] {W105} Redefinition of ID: EventRelation_IER_0000004_id1423936035\n",
      "17:23:48 WARN  riot            :: [line: 23012, col: 73] {W105} Previous definition of 'EventRelation_IER_0000004_id1423936035'.\n",
      "17:23:48 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/IL-4_signaling.owl\n",
      "17:23:48 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/GPCR_signaling-G_alpha_i-.owl\n",
      "17:23:48 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/FGF.owl\n",
      "17:23:48 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/TLR_JNK.owl\n",
      "17:23:49 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/TGF-beta_signaling_TAK1.owl\n",
      "17:23:49 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/GPCR_signaling-G_alpha_s_Epac_and_ERK-.owl\n",
      "17:23:49 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/IL-6_signaling.owl\n",
      "17:23:49 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/Growth_hormone_signaling.owl\n",
      "17:23:49 WARN  riot            :: [line: 5948, col: 73] {W105} Redefinition of ID: EventRelation_IER_0000004_id1634539774\n",
      "17:23:49 WARN  riot            :: [line: 5938, col: 73] {W105} Previous definition of 'EventRelation_IER_0000004_id1634539774'.\n",
      "17:23:49 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/TPO_signaling.owl\n",
      "17:23:49 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/PDGF.owl\n",
      "17:23:49 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/GPCR_Adenosine_A2A_receptor.owl\n",
      "17:23:49 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/VEGF.owl\n",
      "17:23:49 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/NGF.owl\n",
      "17:23:49 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/EGF.owl\n",
      "17:23:49 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/FGF8_Mouse.owl\n",
      "17:23:49 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/TNF.owl\n",
      "17:23:49 WARN  riot            :: Lexical form 'n' not valid for datatype XSD float\n",
      "17:23:49 WARN  riot            :: Lexical form 'n' not valid for datatype XSD float\n",
      "17:23:49 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/TLR_ECSIT_MEKK1_JNK.owl\n",
      "17:23:49 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/GPCR_signaling-G_alpha_q-.owl\n",
      "17:23:49 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/IFN_gamma_signaling.owl\n",
      "17:23:49 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/BMP_signaling_Dro.owl\n",
      "17:23:50 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/DroIMD.owl\n",
      "17:23:50 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/insulin_Dro.owl\n",
      "17:23:50 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/GPCR_GroupI_metabotropic_glutamate_receptor.owl\n",
      "17:23:50 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/IL-23_signaling.owl\n",
      "17:23:50 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/GPCR_signaling-cholera_toxin-.owl\n",
      "17:23:50 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/Notch.owl\n",
      "17:23:50 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/Wnt_DROME.owl\n",
      "17:23:50 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/BMP2_signaling_TGF-beta_MV.owl\n",
      "17:23:50 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/IL-12_signaling.owl\n",
      "17:23:50 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/IFN_alpha_signaling.owl\n",
      "17:23:51 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/EPO_signaling.owl\n",
      "17:23:51 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/LIF_signaling.owl\n",
      "17:23:51 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/B_cell_receptor_signaling.owl\n",
      "17:23:51 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/Wnt_XENLA.owl\n",
      "17:23:51 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/Wnt_Mammals.owl\n",
      "17:23:51 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/Hedgehog.owl\n",
      "17:23:51 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/insulin.owl\n",
      "17:23:52 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/IL-3_signaling.owl\n",
      "17:23:52 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/FGF_Dro.owl\n",
      "17:23:52 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/CD4_T_cell_receptor_signaling-NFkB_cascade-.owl\n",
      "17:23:52 WARN  riot            :: [line: 11980, col: 72] {W105} Redefinition of ID: EventRelation_IER_0000003_id623948212\n",
      "17:23:52 WARN  riot            :: [line: 11970, col: 72] {W105} Previous definition of 'EventRelation_IER_0000003_id623948212'.\n",
      "17:23:52 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/DroToll-like.owl\n",
      "17:23:52 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/IL-2_signaling.owl\n",
      "17:23:52 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/FGF8_Xenopus.owl\n",
      "17:23:52 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/Wnt_Canonical.owl\n",
      "17:23:52 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/IL-13_signaling.owl\n",
      "17:23:52 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/HGF.owl\n",
      "17:23:52 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/Integrin.owl\n",
      "17:23:52 WARN  riot            :: Lexical form 'n' not valid for datatype XSD float\n",
      "17:23:52 WARN  riot            :: Lexical form 'n' not valid for datatype XSD float\n",
      "17:23:52 WARN  riot            :: Lexical form 'n' not valid for datatype XSD float\n",
      "17:23:52 WARN  riot            :: Lexical form 'n' not valid for datatype XSD float\n",
      "17:23:52 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/GPCR_Dopamine_D1like_receptor.owl\n",
      "17:23:52 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/CD4_T_cell_receptor_signaling.owl\n",
      "17:23:52 WARN  riot            :: [line: 17102, col: 73] {W105} Redefinition of ID: EventRelation_IER_0000003_id2008830371\n",
      "17:23:52 WARN  riot            :: [line: 17092, col: 73] {W105} Previous definition of 'EventRelation_IER_0000003_id2008830371'.\n",
      "17:23:52 WARN  riot            :: [line: 17121, col: 73] {W105} Redefinition of ID: EventRelation_IER_0000003_id1953579198\n",
      "17:23:52 WARN  riot            :: [line: 17112, col: 73] {W105} Previous definition of 'EventRelation_IER_0000003_id1953579198'.\n",
      "17:23:52 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/BMP2_signaling_TAK1.owl\n",
      "17:23:52 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/IL-1_p38.owl\n",
      "17:23:52 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/TGF-beta_super_family_signaling_pathway_canonical.owl\n",
      "17:23:53 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/IL-5_signaling.owl\n",
      "17:23:53 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/Wnt_CAEEL.owl\n",
      "17:23:53 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/insulin_Mam.owl\n",
      "17:23:53 WARN  riot            :: Lexical form 'n' not valid for datatype XSD float\n",
      "17:23:53 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/GPCR_signaling-pertussis_toxin-.owl\n",
      "17:23:53 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/Fas.owl\n",
      "17:23:53 WARN  riot            :: Lexical form 'n' not valid for datatype XSD float\n",
      "17:23:53 WARN  riot            :: Lexical form 'n' not valid for datatype XSD float\n",
      "17:23:53 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/IL-1_JNK.owl\n",
      "17:23:53 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/IL-7_signaling.owl\n",
      "17:23:53 WARN  riot            :: [line: 6821, col: 73] {W105} Redefinition of ID: EventRelation_IER_0000003_id1087094276\n",
      "17:23:53 WARN  riot            :: [line: 6812, col: 73] {W105} Previous definition of 'EventRelation_IER_0000003_id1087094276'.\n",
      "17:23:53 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/GPCR_signaling-G_alpha_s_PKA_and_ERK-.owl\n",
      "17:23:53 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/IGF_signaling.owl\n",
      "17:23:53 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/TLR_ECSIT_MEKK1_p38.owl\n",
      "17:23:53 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/PathwayCommons/inoh_pc/signaling/CD4_T_cell_receptor_signaling-JNK_cascade-.owl\n",
      "17:23:53 WARN  riot            :: [line: 7523, col: 72] {W105} Redefinition of ID: EventRelation_IER_0000003_id239193964\n",
      "17:23:53 WARN  riot            :: [line: 7514, col: 72] {W105} Previous definition of 'EventRelation_IER_0000003_id239193964'.\n",
      "17:23:53 INFO  Server          :: Dataset: in-memory: load file: /home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/../../BioPAX_Data/BioPAX_Ontology/biopax-level3.owl\n",
      "17:23:54 INFO  Server          :: Running in read-only mode for /inoh_pc\n",
      "17:23:54 INFO  Server          :: Apache Jena Fuseki 4.9.0\n",
      "17:23:54 INFO  Config          :: FUSEKI_HOME=/home/cbeust/Softwares/JenaFuseki/apache-jena-fuseki-4.9.0\n",
      "17:23:54 INFO  Config          :: FUSEKI_BASE=/home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/run\n",
      "17:23:54 INFO  Config          :: Shiro file: file:///home/cbeust/Projects/2024/BioPAX_Review/BioPAXReview2024Codes/Figure4-5/Scripts/run/shiro.ini\n",
      "17:23:54 INFO  Server          :: Database: in-memory, with files loaded\n",
      "17:23:54 INFO  Server          :: Path = /inoh_pc\n",
      "17:23:54 INFO  Server          ::   Memory: 16.0 GiB\n",
      "17:23:54 INFO  Server          ::   Java:   17.0.11\n",
      "17:23:54 INFO  Server          ::   OS:     Linux 6.8.9-100.fc38.x86_64 amd64\n",
      "17:23:54 INFO  Server          ::   PID:    92173\n",
      "17:23:54 INFO  Server          :: Started 2024/10/04 17:23:54 CEST on port 3030\n",
      "17:24:44 INFO  Fuseki          :: [7] GET http://localhost:3030/inoh_pc/query?query=%0APREFIX+rdf%3A+%3Chttp%3A//www.w3.org/1999/02/22-rdf-syntax-ns%23%3E%0APREFIX+rdfs%3A%3Chttp%3A//www.w3.org/2000/01/rdf-schema%23%3E%0APREFIX+owl%3A+%3Chttp%3A//www.w3.org/2002/07/owl%23%3E%0APREFIX+xsd%3A+%3Chttp%3A//www.w3.org/2001/XMLSchema%23%3E%0APREFIX+dc%3A+%3Chttp%3A//purl.org/dc/elements/1.1/%3E%0APREFIX+dcterms%3A+%3Chttp%3A//purl.org/dc/terms/%3E%0A%0APREFIX+chebi%3A+%3Chttp%3A//purl.obolibrary.org/obo/chebi/%3E%0APREFIX+chebidb%3A+%3Chttp%3A//purl.obolibrary.org/obo/CHEBI_%3E%0APREFIX+chebirel%3A+%3Chttp%3A//purl.obolibrary.org/obo/CHEBI%23%3E%0APREFIX+oboInOwl%3A+%3Chttp%3A//www.geneontology.org/formats/oboInOwl%23%3E%0A%0APREFIX+bp3%3A+%3Chttp%3A//www.biopax.org/release/biopax-level3.owl%23%3E%0A%0A%23+Homo_sapiens-20170221.owl%0A%23PREFIX+reactome%3A+%3Chttp%3A//www.reactome.org/biopax/59/48887%23%3E+%0A%23%0A%23+Homo_sapiens-20210608.owl%0A%23PREFIX+reactome%3A+%3Chttp%3A//www.reactome.org/biopax/77/48887%23%3E%0A%23%0A%23+Homo_sapiens-20220614.owl%0A%23PREFIX+reactome%3A+%3Chttp%3A//www.reactome.org/biopax/81/48887%23%3E%0A%23%0A%23+Homo_sapiens-20221130.owl%0A%23PREFIX+reactome%3A+%3Chttp%3A//www.reactome.org/biopax/83/48887%23%3E%0A%0APREFIX+reactome%3A+%3Chttp%3A//www.reactome.org/biopax/87/48887%23%3E%0A%0ASELECT+%3Fmetric+%3Fcount%0A%23+Number+of+instances+of+Protein%0AWHERE+%7B%0AOPTIONAL+%7B%0A++++%7B%0A++++++++SELECT+%3Fmetric+%28COUNT%28DISTINCT+%3Fprotein%29+AS+%3Fcount%29%0A++++++++WHERE+%7B%0A++++++++++++BIND%28%22Protein%22+AS+%3Fmetric%29%0A++++++++++++%3Fprotein+rdf%3Atype/%28rdfs%3AsubClassOf%2A%29+bp3%3AProtein+.%0A++++++++%7D%0A++++++++GROUP+BY+%3Fmetric%0A++++%7D%0A++++UNION%0A++++%7B%0A++++++++SELECT+%3Fmetric+%28COUNT%28DISTINCT+%3Fprotein_ref%29+AS+%3Fcount%29%0A++++++++WHERE+%7B%0A++++++++++++BIND%28%22ProteinReference%22+AS+%3Fmetric%29%0A++++++++++++%3Fprotein_ref+rdf%3Atype+bp3%3AProteinReference+.%0A++++++++%7D%0A++++++++GROUP+BY+%3Fmetric%0A++++%7D%0A++++UNION%0A++++%7B%0A++++++++SELECT+%3Fmetric+%28COUNT%28DISTINCT+%3Fprotein_without_ref%29+AS+%3Fcount%29%0A++++++++WHERE+%7B%0A++++++++++++BIND%28%22Protein+with+no+PR%22+AS+%3Fmetric%29%0A++++++++++++OPTIONAL+%7B%0A++++++++++++%3Fprotein_without_ref+rdf%3Atype/%28rdfs%3AsubClassOf%2A%29+bp3%3AProtein+.%0A++++++++++++FILTER+NOT+EXISTS+%7B%0A++++++++++++++++%3Fprotein_without_ref+bp3%3AentityReference+%3Fref+.%0A++++++++++++++++%3Fref+rdf%3Atype+bp3%3AProteinReference+.%0A++++++++++++%7D%0A++++++++%7D%0A++++++++%7D%0A++++++++GROUP+BY+%3Fmetric%0A++++%7D%0A++++UNION%0A++++%7B%0A++++++++SELECT+%3Fmetric+%28COUNT%28DISTINCT+%3Fprotein_that_map_to_uniprot%29+AS+%3Fcount%29%0A++++++++WHERE+%7B%0A++++++++++++BIND%28%22Uniprot+mappings%22+AS+%3Fmetric%29%0A++++++++++++%3Fprotein_that_map_to_uniprot+rdf%3Atype+bp3%3AProtein+.%0A++++++++++++%3Fprotein_that_map_to_uniprot+bp3%3AentityReference+%3Fprotein_ref+.%0A++++++++++++%3Fprotein_ref+rdf%3Atype+bp3%3AProteinReference+.%0A++++++++++++%3Fprotein_that_map_to_uniprot+bp3%3Axref+%3Fprotein_xref+.%0A++++++++++++%3Fprotein_xref+rdf%3Atype+bp3%3AUnificationXref+.%0A++++++++++++%3Fprotein_xref+bp3%3Adb+%22UniProt%22+.%0A++++++++++++%3Fprotein_xref+bp3%3Aid+%3Fup_id+.%0A++++++++%7D%0A++++++++GROUP+BY+%3Fmetric%0A++++%7D%0A++++UNION+%0A++++%7B%0A++++++++SELECT+%3Fmetric+%28COUNT%28DISTINCT+%3Fprotein_no_map_to_uniprot%29+AS+%3Fcount%29%0A++++++++WHERE+%7B%0A++++++++++++BIND%28%22Protein+with+no+mapping%22+AS+%3Fmetric%29%0A++++++++++++%3Fprotein_no_map_to_uniprot+rdf%3Atype/%28rdfs%3AsubClassOf%2A%29+bp3%3AProtein+.%0A++++++++++++%3Fprotein_no_map_to_uniprot+bp3%3AentityReference+%3Fprotein_ref+.%0A++++++++++++%3Fprotein_ref+rdf%3Atype+bp3%3AentityReference+.%0A++++++++++++FILTER+NOT+EXISTS+%7B%0A++++++++++++++++%3Fprotein_no_map_to_uniprot+bp3%3Axref+%3Fprotein_xref+.%0A++++++++++++++++%3Fprotein_xref+rdf%3Atype+bp3%3AUnificationXref+.%0A++++++++++++++++%3Fprotein_xref+bp3%3Adb+%22UniProt%22+.%0A++++++++++++++++%3Fprotein_xref+bp3%3Aid+%3Fid+.%0A++++++++++++%7D%0A++++++++%7D%0A++++++++GROUP+BY+%3Fmetric%0A++++%7D%0A++++UNION+%0A++++%7B%0A++++++++SELECT+%3Fmetric+%28COUNT%28DISTINCT+%3Fup_id%29+AS+%3Fcount%29%0A++++++++WHERE+%7B%0A++++++++++++BIND%28%22Unique+Uniprot%22+AS+%3Fmetric%29%0A++++++++++++%3Funif_xref+rdf%3Atype+bp3%3AUnificationXref+.%0A++++++++++++%3Funif_xref+bp3%3Adb+%22UniProt%22+.%0A++++++++++++%3Funif_xref+bp3%3Aid+%3Fup_id+.%0A++++++++%7D%0A++++++++GROUP+BY+%3Fmetric%0A++++%7D%0A+++%7D%0A%7D%0AORDER+BY+%3Fmetric%0A&format=json&output=json&results=json\n",
      "17:24:44 INFO  Fuseki          :: [7] Query =  PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs:<http://www.w3.org/2000/01/rdf-schema#> PREFIX owl: <http://www.w3.org/2002/07/owl#> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> PREFIX dc: <http://purl.org/dc/elements/1.1/> PREFIX dcterms: <http://purl.org/dc/terms/>  PREFIX chebi: <http://purl.obolibrary.org/obo/chebi/> PREFIX chebidb: <http://purl.obolibrary.org/obo/CHEBI_> PREFIX chebirel: <http://purl.obolibrary.org/obo/CHEBI#> PREFIX oboInOwl: <http://www.geneontology.org/formats/oboInOwl#>  PREFIX bp3: <http://www.biopax.org/release/biopax-level3.owl#>  # Homo_sapiens-20170221.owl #PREFIX reactome: <http://www.reactome.org/biopax/59/48887#>  # # Homo_sapiens-20210608.owl #PREFIX reactome: <http://www.reactome.org/biopax/77/48887#> # # Homo_sapiens-20220614.owl #PREFIX reactome: <http://www.reactome.org/biopax/81/48887#> # # Homo_sapiens-20221130.owl #PREFIX reactome: <http://www.reactome.org/biopax/83/48887#>  PREFIX reactome: <http://www.reactome.org/biopax/87/48887#>  SELECT ?metric ?count # Number of instances of Protein WHERE { OPTIONAL {     {         SELECT ?metric (COUNT(DISTINCT ?protein) AS ?count)         WHERE {             BIND(\"Protein\" AS ?metric)             ?protein rdf:type/(rdfs:subClassOf*) bp3:Protein .         }         GROUP BY ?metric     }     UNION     {         SELECT ?metric (COUNT(DISTINCT ?protein_ref) AS ?count)         WHERE {             BIND(\"ProteinReference\" AS ?metric)             ?protein_ref rdf:type bp3:ProteinReference .         }         GROUP BY ?metric     }     UNION     {         SELECT ?metric (COUNT(DISTINCT ?protein_without_ref) AS ?count)         WHERE {             BIND(\"Protein with no PR\" AS ?metric)             OPTIONAL {             ?protein_without_ref rdf:type/(rdfs:subClassOf*) bp3:Protein .             FILTER NOT EXISTS {                 ?protein_without_ref bp3:entityReference ?ref .                 ?ref rdf:type bp3:ProteinReference .             }         }         }         GROUP BY ?metric     }     UNION     {         SELECT ?metric (COUNT(DISTINCT ?protein_that_map_to_uniprot) AS ?count)         WHERE {             BIND(\"Uniprot mappings\" AS ?metric)             ?protein_that_map_to_uniprot rdf:type bp3:Protein .             ?protein_that_map_to_uniprot bp3:entityReference ?protein_ref .             ?protein_ref rdf:type bp3:ProteinReference .             ?protein_that_map_to_uniprot bp3:xref ?protein_xref .             ?protein_xref rdf:type bp3:UnificationXref .             ?protein_xref bp3:db \"UniProt\" .             ?protein_xref bp3:id ?up_id .         }         GROUP BY ?metric     }     UNION      {         SELECT ?metric (COUNT(DISTINCT ?protein_no_map_to_uniprot) AS ?count)         WHERE {             BIND(\"Protein with no mapping\" AS ?metric)             ?protein_no_map_to_uniprot rdf:type/(rdfs:subClassOf*) bp3:Protein .             ?protein_no_map_to_uniprot bp3:entityReference ?protein_ref .             ?protein_ref rdf:type bp3:entityReference .             FILTER NOT EXISTS {                 ?protein_no_map_to_uniprot bp3:xref ?protein_xref .                 ?protein_xref rdf:type bp3:UnificationXref .                 ?protein_xref bp3:db \"UniProt\" .                 ?protein_xref bp3:id ?id .             }         }         GROUP BY ?metric     }     UNION      {         SELECT ?metric (COUNT(DISTINCT ?up_id) AS ?count)         WHERE {             BIND(\"Unique Uniprot\" AS ?metric)             ?unif_xref rdf:type bp3:UnificationXref .             ?unif_xref bp3:db \"UniProt\" .             ?unif_xref bp3:id ?up_id .         }         GROUP BY ?metric     }    } } ORDER BY ?metric \n",
      "17:24:45 INFO  Fuseki          :: [7] 200 OK (984 ms)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table><tr><th>metric</th><th>count</th></tr><tr><td>Protein</td><td>12804</td></tr><tr><td>Protein with no PR</td><td>0</td></tr><tr><td>ProteinReference</td><td>1337</td></tr><tr><td>Uniprot mappings</td><td>12764</td></tr><tr><td>Unique Uniprot</td><td>3398</td></tr></table>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "17:24:45 INFO  Fuseki          :: [8] GET http://localhost:3030/inoh_pc/query?query=%0APREFIX+rdf%3A+%3Chttp%3A//www.w3.org/1999/02/22-rdf-syntax-ns%23%3E%0APREFIX+rdfs%3A%3Chttp%3A//www.w3.org/2000/01/rdf-schema%23%3E%0APREFIX+owl%3A+%3Chttp%3A//www.w3.org/2002/07/owl%23%3E%0APREFIX+xsd%3A+%3Chttp%3A//www.w3.org/2001/XMLSchema%23%3E%0APREFIX+dc%3A+%3Chttp%3A//purl.org/dc/elements/1.1/%3E%0APREFIX+dcterms%3A+%3Chttp%3A//purl.org/dc/terms/%3E%0A%0APREFIX+chebi%3A+%3Chttp%3A//purl.obolibrary.org/obo/chebi/%3E%0APREFIX+chebidb%3A+%3Chttp%3A//purl.obolibrary.org/obo/CHEBI_%3E%0APREFIX+chebirel%3A+%3Chttp%3A//purl.obolibrary.org/obo/CHEBI%23%3E%0APREFIX+oboInOwl%3A+%3Chttp%3A//www.geneontology.org/formats/oboInOwl%23%3E%0A%0APREFIX+bp3%3A+%3Chttp%3A//www.biopax.org/release/biopax-level3.owl%23%3E%0A%0A%23+Homo_sapiens-20170221.owl%0A%23PREFIX+reactome%3A+%3Chttp%3A//www.reactome.org/biopax/59/48887%23%3E+%0A%23%0A%23+Homo_sapiens-20210608.owl%0A%23PREFIX+reactome%3A+%3Chttp%3A//www.reactome.org/biopax/77/48887%23%3E%0A%23%0A%23+Homo_sapiens-20220614.owl%0A%23PREFIX+reactome%3A+%3Chttp%3A//www.reactome.org/biopax/81/48887%23%3E%0A%23%0A%23+Homo_sapiens-20221130.owl%0A%23PREFIX+reactome%3A+%3Chttp%3A//www.reactome.org/biopax/83/48887%23%3E%0A%0APREFIX+reactome%3A+%3Chttp%3A//www.reactome.org/biopax/87/48887%23%3E%0A%0ASELECT+%3Fmetric+%3Fcount%0A%23+Number+of+instances+of+Protein%0AWHERE+%7B%0AOPTIONAL+%7B%0A++++%7B%0A++++++++SELECT+%3Fmetric+%28COUNT%28DISTINCT+%3Fprotein%29+AS+%3Fcount%29%0A++++++++WHERE+%7B%0A++++++++++++BIND%28%22Protein%22+AS+%3Fmetric%29%0A++++++++++++%3Fprotein+rdf%3Atype/%28rdfs%3AsubClassOf%2A%29+bp3%3AProtein+.%0A++++++++%7D%0A++++++++GROUP+BY+%3Fmetric%0A++++%7D%0A++++UNION%0A++++%7B%0A++++++++SELECT+%3Fmetric+%28COUNT%28DISTINCT+%3Fprotein_ref%29+AS+%3Fcount%29%0A++++++++WHERE+%7B%0A++++++++++++BIND%28%22ProteinReference%22+AS+%3Fmetric%29%0A++++++++++++%3Fprotein_ref+rdf%3Atype+bp3%3AProteinReference+.%0A++++++++%7D%0A++++++++GROUP+BY+%3Fmetric%0A++++%7D%0A++++UNION%0A++++%7B%0A++++++++SELECT+%3Fmetric+%28COUNT%28DISTINCT+%3Fprotein_without_ref%29+AS+%3Fcount%29%0A++++++++WHERE+%7B%0A++++++++++++BIND%28%22Protein+with+no+PR%22+AS+%3Fmetric%29%0A++++++++++++OPTIONAL+%7B%0A++++++++++++%3Fprotein_without_ref+rdf%3Atype/%28rdfs%3AsubClassOf%2A%29+bp3%3AProtein+.%0A++++++++++++FILTER+NOT+EXISTS+%7B%0A++++++++++++++++%3Fprotein_without_ref+bp3%3AentityReference+%3Fref+.%0A++++++++++++++++%3Fref+rdf%3Atype+bp3%3AProteinReference+.%0A++++++++++++%7D%0A++++++++%7D%0A++++++++%7D%0A++++++++GROUP+BY+%3Fmetric%0A++++%7D%0A++++UNION%0A++++%7B%0A++++++++SELECT+%3Fmetric+%28COUNT%28DISTINCT+%3Fprotein_that_map_to_uniprot%29+AS+%3Fcount%29%0A++++++++WHERE+%7B%0A++++++++++++BIND%28%22Uniprot+mappings%22+AS+%3Fmetric%29%0A++++++++++++%3Fprotein_that_map_to_uniprot+rdf%3Atype+bp3%3AProtein+.%0A++++++++++++%3Fprotein_that_map_to_uniprot+bp3%3AentityReference+%3Fprotein_ref+.%0A++++++++++++%3Fprotein_ref+rdf%3Atype+bp3%3AProteinReference+.%0A++++++++++++%3Fprotein_that_map_to_uniprot+bp3%3Axref+%3Fprotein_xref+.%0A++++++++++++%3Fprotein_xref+rdf%3Atype+bp3%3AUnificationXref+.%0A++++++++++++%3Fprotein_xref+bp3%3Adb+%22UniProt%22+.%0A++++++++++++%3Fprotein_xref+bp3%3Aid+%3Fup_id+.%0A++++++++%7D%0A++++++++GROUP+BY+%3Fmetric%0A++++%7D%0A++++UNION+%0A++++%7B%0A++++++++SELECT+%3Fmetric+%28COUNT%28DISTINCT+%3Fprotein_no_map_to_uniprot%29+AS+%3Fcount%29%0A++++++++WHERE+%7B%0A++++++++++++BIND%28%22Protein+with+no+mapping%22+AS+%3Fmetric%29%0A++++++++++++%3Fprotein_no_map_to_uniprot+rdf%3Atype/%28rdfs%3AsubClassOf%2A%29+bp3%3AProtein+.%0A++++++++++++%3Fprotein_no_map_to_uniprot+bp3%3AentityReference+%3Fprotein_ref+.%0A++++++++++++%3Fprotein_ref+rdf%3Atype+bp3%3AentityReference+.%0A++++++++++++FILTER+NOT+EXISTS+%7B%0A++++++++++++++++%3Fprotein_no_map_to_uniprot+bp3%3Axref+%3Fprotein_xref+.%0A++++++++++++++++%3Fprotein_xref+rdf%3Atype+bp3%3AUnificationXref+.%0A++++++++++++++++%3Fprotein_xref+bp3%3Adb+%22UniProt%22+.%0A++++++++++++++++%3Fprotein_xref+bp3%3Aid+%3Fid+.%0A++++++++++++%7D%0A++++++++%7D%0A++++++++GROUP+BY+%3Fmetric%0A++++%7D%0A++++UNION+%0A++++%7B%0A++++++++SELECT+%3Fmetric+%28COUNT%28DISTINCT+%3Fup_id%29+AS+%3Fcount%29%0A++++++++WHERE+%7B%0A++++++++++++BIND%28%22Unique+Uniprot%22+AS+%3Fmetric%29%0A++++++++++++%3Funif_xref+rdf%3Atype+bp3%3AUnificationXref+.%0A++++++++++++%3Funif_xref+bp3%3Adb+%22UniProt%22+.%0A++++++++++++%3Funif_xref+bp3%3Aid+%3Fup_id+.%0A++++++++%7D%0A++++++++GROUP+BY+%3Fmetric%0A++++%7D%0A+++%7D%0A%7D%0AORDER+BY+%3Fmetric%0A&format=csv&output=csv&results=csv\n",
      "17:24:45 INFO  Fuseki          :: [8] Query =  PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs:<http://www.w3.org/2000/01/rdf-schema#> PREFIX owl: <http://www.w3.org/2002/07/owl#> PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> PREFIX dc: <http://purl.org/dc/elements/1.1/> PREFIX dcterms: <http://purl.org/dc/terms/>  PREFIX chebi: <http://purl.obolibrary.org/obo/chebi/> PREFIX chebidb: <http://purl.obolibrary.org/obo/CHEBI_> PREFIX chebirel: <http://purl.obolibrary.org/obo/CHEBI#> PREFIX oboInOwl: <http://www.geneontology.org/formats/oboInOwl#>  PREFIX bp3: <http://www.biopax.org/release/biopax-level3.owl#>  # Homo_sapiens-20170221.owl #PREFIX reactome: <http://www.reactome.org/biopax/59/48887#>  # # Homo_sapiens-20210608.owl #PREFIX reactome: <http://www.reactome.org/biopax/77/48887#> # # Homo_sapiens-20220614.owl #PREFIX reactome: <http://www.reactome.org/biopax/81/48887#> # # Homo_sapiens-20221130.owl #PREFIX reactome: <http://www.reactome.org/biopax/83/48887#>  PREFIX reactome: <http://www.reactome.org/biopax/87/48887#>  SELECT ?metric ?count # Number of instances of Protein WHERE { OPTIONAL {     {         SELECT ?metric (COUNT(DISTINCT ?protein) AS ?count)         WHERE {             BIND(\"Protein\" AS ?metric)             ?protein rdf:type/(rdfs:subClassOf*) bp3:Protein .         }         GROUP BY ?metric     }     UNION     {         SELECT ?metric (COUNT(DISTINCT ?protein_ref) AS ?count)         WHERE {             BIND(\"ProteinReference\" AS ?metric)             ?protein_ref rdf:type bp3:ProteinReference .         }         GROUP BY ?metric     }     UNION     {         SELECT ?metric (COUNT(DISTINCT ?protein_without_ref) AS ?count)         WHERE {             BIND(\"Protein with no PR\" AS ?metric)             OPTIONAL {             ?protein_without_ref rdf:type/(rdfs:subClassOf*) bp3:Protein .             FILTER NOT EXISTS {                 ?protein_without_ref bp3:entityReference ?ref .                 ?ref rdf:type bp3:ProteinReference .             }         }         }         GROUP BY ?metric     }     UNION     {         SELECT ?metric (COUNT(DISTINCT ?protein_that_map_to_uniprot) AS ?count)         WHERE {             BIND(\"Uniprot mappings\" AS ?metric)             ?protein_that_map_to_uniprot rdf:type bp3:Protein .             ?protein_that_map_to_uniprot bp3:entityReference ?protein_ref .             ?protein_ref rdf:type bp3:ProteinReference .             ?protein_that_map_to_uniprot bp3:xref ?protein_xref .             ?protein_xref rdf:type bp3:UnificationXref .             ?protein_xref bp3:db \"UniProt\" .             ?protein_xref bp3:id ?up_id .         }         GROUP BY ?metric     }     UNION      {         SELECT ?metric (COUNT(DISTINCT ?protein_no_map_to_uniprot) AS ?count)         WHERE {             BIND(\"Protein with no mapping\" AS ?metric)             ?protein_no_map_to_uniprot rdf:type/(rdfs:subClassOf*) bp3:Protein .             ?protein_no_map_to_uniprot bp3:entityReference ?protein_ref .             ?protein_ref rdf:type bp3:entityReference .             FILTER NOT EXISTS {                 ?protein_no_map_to_uniprot bp3:xref ?protein_xref .                 ?protein_xref rdf:type bp3:UnificationXref .                 ?protein_xref bp3:db \"UniProt\" .                 ?protein_xref bp3:id ?id .             }         }         GROUP BY ?metric     }     UNION      {         SELECT ?metric (COUNT(DISTINCT ?up_id) AS ?count)         WHERE {             BIND(\"Unique Uniprot\" AS ?metric)             ?unif_xref rdf:type bp3:UnificationXref .             ?unif_xref bp3:db \"UniProt\" .             ?unif_xref bp3:id ?up_id .         }         GROUP BY ?metric     }    } } ORDER BY ?metric \n",
      "17:24:45 INFO  Fuseki          :: [8] 200 OK (452 ms)\n"
     ]
    }
   ],
   "source": [
    "PathwayCommons_Inoh_file_path = os.path.join(current_directory, '../..', 'BioPAX_Data/PathwayCommons/inoh_pc/')\n",
    "Inoh_owl_files_metabolic = glob.glob(os.path.join(PathwayCommons_Inoh_file_path, 'metabolic/*.owl'))\n",
    "Inoh_owl_files_signaling = glob.glob(os.path.join(PathwayCommons_Inoh_file_path, 'signaling/*.owl'))\n",
    "Inoh_owl_files = Inoh_owl_files_metabolic + Inoh_owl_files_signaling\n",
    "command = ['/home/cbeust/Softwares/JenaFuseki/apache-jena-fuseki-4.9.0/fuseki-server',]\n",
    "\n",
    "for owl_file in Inoh_owl_files:\n",
    "    command += ['--file'] \n",
    "    command += [f'{owl_file}']\n",
    "command += ['--file']\n",
    "command += [f'{BioPAX_Ontology_file_path}']\n",
    "command += ['/inoh_pc']\n",
    "\n",
    "process = subprocess.Popen(command)\n",
    "time.sleep(60)\n",
    "\n",
    "# execute SPARQL query\n",
    "sparql = SPARQLWrapper(endpointURL_inoh_pc)\n",
    "sparql.setQuery(prefixes+query4)\n",
    "\n",
    "# display results\n",
    "sparql.setReturnFormat(JSON)\n",
    "results = sparql.query().convert()\n",
    "displaySparqlResults(results)\n",
    "\n",
    "# export to CSV\n",
    "sparql.setReturnFormat(CSV)\n",
    "results = sparql.query().convert()\n",
    "with open(\"../Results/inoh_pc_mappings_uniprot.csv\", \"wb\") as f:\n",
    "    f.write(results)\n",
    "\n",
    "# end process\n",
    "process.kill()\n",
    "time.sleep(60)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Query on BioPAX export of NetPath from PathwayCommons"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "PathwayCommons_Netpath_file_path = os.path.join(current_directory, '../..', 'BioPAX_Data/PathwayCommons/netpath_pc/')\n",
    "\n",
    "Netpath_owl_files = glob.glob(os.path.join(PathwayCommons_Netpath_file_path, '*.owl'))\n",
    "\n",
    "\n",
    "# Remove the incorrect owl file and add the corrected one\n",
    "to_remove1 = os.path.join(PathwayCommons_Netpath_file_path, 'NetPath_7.owl')\n",
    "to_remove2 = os.path.join(PathwayCommons_Netpath_file_path, 'NetPath_11.owl')\n",
    "to_remove3 = os.path.join(PathwayCommons_Netpath_file_path, 'NetPath_22.owl')\n",
    "to_remove4 = os.path.join(PathwayCommons_Netpath_file_path, 'NetPath_9.owl')\n",
    "Netpath_owl_files.remove(to_remove1)\n",
    "Netpath_owl_files.remove(to_remove2)\n",
    "Netpath_owl_files.remove(to_remove3)\n",
    "Netpath_owl_files.remove(to_remove4)\n",
    "to_add1 = os.path.join(PathwayCommons_Netpath_file_path, 'NetPath_7_corrected.owl')\n",
    "to_add2 = os.path.join(PathwayCommons_Netpath_file_path, 'NetPath_11_corrected.owl')\n",
    "to_add3 = os.path.join(PathwayCommons_Netpath_file_path, 'NetPath_22_corrected.owl')\n",
    "to_add4 = os.path.join(PathwayCommons_Netpath_file_path, 'NetPath_9_corrected.owl')\n",
    "Netpath_owl_files.append(to_add1)\n",
    "Netpath_owl_files.append(to_add2)\n",
    "Netpath_owl_files.append(to_add3)\n",
    "Netpath_owl_files.append(to_add4)\n",
    "\n",
    "command = ['/home/cbeust/Softwares/JenaFuseki/apache-jena-fuseki-4.9.0/fuseki-server',]\n",
    "\n",
    "for owl_file in Netpath_owl_files:\n",
    "    command += ['--file'] \n",
    "    command += [f'{owl_file}']\n",
    "command += ['--file']\n",
    "command += [f'{BioPAX_Ontology_file_path}']\n",
    "command += ['/netpath_pc']\n",
    "\n",
    "process = subprocess.Popen(command)\n",
    "time.sleep(60)\n",
    "\n",
    "# execute SPARQL query\n",
    "sparql = SPARQLWrapper(endpointURL_netpath_pc)\n",
    "sparql.setQuery(prefixes+query5)\n",
    "\n",
    "# display results\n",
    "sparql.setReturnFormat(JSON)\n",
    "results = sparql.query().convert()\n",
    "displaySparqlResults(results)\n",
    "\n",
    "# export to CSV\n",
    "sparql.setReturnFormat(CSV)\n",
    "results = sparql.query().convert()\n",
    "with open(\"../Results/netpath_pc_mappings_uniprot.csv\", \"wb\") as f:\n",
    "    f.write(results)\n",
    "\n",
    "# end process\n",
    "process.kill()\n",
    "time.sleep(60)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "biopax_sparql_queries",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
